Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If no other solution works and compatibility with Quarkus 3.8 or earlier is required, set `quarkus.transaction-manager.unsafe-multiple-last-resources` to `allow` to enable unsafe transaction handling across multiple non-XA datasources.
ja_jp: 他の解決策がなく、Quarkus 3.8以前との互換性が必要な場合は、 `quarkus.transaction-manager.unsafe-multiple-last-resources` を `allow` に設定して、複数の非XAデータソースにわたる安全でないトランザクション処理を有効にします。

source: If no other solution works, and to maintain compatibility with Quarkus 3.8 and earlier, set `quarkus.transaction-manager.unsafe-multiple-last-resources` to `allow` to enable unsafe transaction handling across multiple non-XA datasources.
ja_jp: 他の解決策が機能しない場合や、Quarkus 3.8 以前との互換性を維持するには、 `quarkus.transaction-manager.unsafe-multiple-last-resources` を `allow` に設定して、複数の非 XA データソース間での安全でないトランザクション処理を有効にしてください。

source: If no registry is set (using `quarkus.container-image.registry`) then `docker.io` will be used as the default.
ja_jp: レジストリーが設定されていない場合 (`quarkus.container-image.registry` を使用) は、 `docker.io` がデフォルトとして使用されます。

source: If no schema information is provided incoming channels will use `Schema.AUTO_CONSUME()`, whereas outgoing channels will use `Schema.AUTO_PRODUCE_BYTES()` schemas.
ja_jp: スキーマ情報が提供されていない場合、着信チャネルは `Schema.AUTO_CONSUME()` を使用します。一方、発信チャネルは `Schema.AUTO_PRODUCE_BYTES()` スキーマを使用します。

source: If no scope annotation is declared on the resource class, then the scope is defaulted. The `quarkus.resteasy.singleton-resources` property can control the default scope.
ja_jp: リソースクラスにスコープアノテーションが宣言されていない場合、スコープはデフォルトに設定されます。 `quarkus.resteasy.singleton-resources` プロパティーはデフォルトのスコープを制御できます。

source: If no shared services are found, they fallback to discovering services started by Compose Dev Services
ja_jp: 共有サービスが見つからない場合、Compose Dev Services によって開始されたサービスの検出にフォールバックします。

source: If no topics are available, the `available_topics` key will not be present in the `data` field of the `Kafka Streams topics health check`. As well as if no topics are missing, the `missing_topics` key will not be present in the `data` field of the `Kafka Streams topics health check`.
ja_jp: トピックがない場合、 `Kafka Streams topics health check` .の `data` フィールドに `available_topics` キーは表示されません。また、トピックがない場合は、 `Kafka Streams topics health check` の `data` フィールドに `missing_topics` キーは表示されません。

source: If no transaction is active then a new transaction will be started, and committed when the method ends. If an exception is thrown the exception handler registered by `#exceptionHandler(Function)` will be called to decide if the TX should be committed or rolled back. If an existing transaction is active then the method is run in the context of the existing transaction. If an exception is thrown the exception handler will be called, however a result of `ExceptionResult#ROLLBACK` will result in the TX marked as rollback only, while a result of `ExceptionResult#COMMIT` will result in no action being taken.
ja_jp: トランザクションがアクティブでない場合、新しいトランザクションが開始され、メソッドの終了時にコミットされます。例外が発生した場合、 `#exceptionHandler(Function)` によって登録された例外ハンドラが呼び出され、TX をコミットするかロールバックするかを決定します。既存のトランザクションがアクティブである場合、メソッドは既存のトランザクションのコンテキストで実行されます。例外が発生した場合、例外ハンドラが呼び出されますが、 `ExceptionResult#ROLLBACK` の結果は、TX がロールバックのみとマークされ、一方 `ExceptionResult#COMMIT` の結果は、何も行われないという結果になります。

source: If no transaction is active then these semantics are basically a no-op. If a transaction is active then it is suspended, and resumed after the task is run. The exception handler will never be consulted when these semantics are in use, specifying both an exception handler and these semantics are considered an error. These semantics allows for code to easily be run outside the scope of a transaction.
ja_jp: トランザクションがアクティブでない場合、このセマンティックは基本的にノー・オペレーションです。もしトランザクションがアクティブであれば、中断され、タスクの実行後に再開されます。このセマンティックが使用されている場合、例外ハンドラは決して参照されず、例外ハンドラとこのセマンティックの両方を指定することはエラーとみなされます。このセマンティックは、トランザクションの範囲外でコードを簡単に実行することを可能にします。

source: If no transaction is active then this semantic is basically a no-op. If a transaction is active then it is suspended, and resumed after the task is run. The exception handler will never be consulted when this semantic is in use, specifying both an exception handler and this semantic is considered an error. This semantic allows for code to easily be run outside the scope of a transaction.
ja_jp: トランザクションがアクティブでない場合、このセマンティックは基本的にノー・オペレーションです。もしトランザクションがアクティブであれば、中断され、タスクの実行後に再開されます。このセマンティックが使用されている場合、例外ハンドラは決して参照されず、例外ハンドラとこのセマンティックの両方を指定することはエラーとみなされます。このセマンティックは、トランザクションの範囲外でコードを簡単に実行することを可能にします。

source: If nonce is required
ja_jp: nonce が必須かどうか

source: If not accessed via the `global:` namespace the global variables may conflict with regular data objects. <<typesafe_templates,Type-safe templates>> override the global variables automatically. For example, the following definition overrides the global variable supplied by the `Globals#user()` method:
ja_jp: `global:` 名前空間経由でアクセスしない場合、グローバル変数は通常のデータオブジェクトと競合する可能性があります。 <<typesafe_templates,Type-safe templates>> は自動的にグローバル変数をオーバーライドします。 たとえば次の定義は、`Globals#user()` メソッドが提供するグローバル変数をオーバーライドします。

source: If not already done in the previous step, you should install the `greeting-extension` in your local repository:
ja_jp: 前のステップでまだ行っていない場合は、ローカルリポジトリに `greeting-extension` をインストールする必要があります。

source: If not set, `key.deserializer` is set to `org.apache.kafka.common.serialization.StringDeserializer`.
ja_jp: 設定されていない場合、 `key.deserializer` は `org.apache.kafka.common.serialization.StringDeserializer` に設定されます。

source: If not set, `key.serializer` is set to `org.apache.kafka.common.serialization.StringSerializer`.
ja_jp: 設定されていない場合、 `key.serializer` は `org.apache.kafka.common.serialization.StringSerializer` に設定されます。

source: If not set, `reconnect.backoff.max.ms` is set to `10000` to avoid high load on disconnection.
ja_jp: 設定されていない場合、切断時の高負荷を回避するために、 `reconnect.backoff.max.ms` は `10000` に設定されます。

source: If not set, producer `client.id` is generated as `[client-id-prefix][channel-name]`.
ja_jp: 設定されていない場合、プロデューサー `client.id` は `[client-id-prefix][channel-name]` として生成されます。

source: If not set, producer `client.id` is generated as `kafka-producer-[channel]`.
ja_jp: 設定されていない場合、プロデューサー `client.id` は `kafka-producer-[channel]` として生成されます。

source: If not set, the address is the fully qualified name of the bean, for instance, in this snippet it's `org.acme.vertx.GreetingService`.
ja_jp: 設定されていない場合、アドレスは Bean の完全修飾名となり、例えばこのスニペットでは `org.acme.vertx.GreetingService` となります。

source: If not set, the address is the fully qualified name of the bean; for instance, in this snippet, it's `org.acme.vertx.GreetingService`.
ja_jp: 設定されていない場合、アドレスはBeanの完全修飾名となります。例えば、このスニペットでは、 `org.acme.vertx.GreetingService` となります。

source: If not specified, the property defaults to `com.google.protobuf:protobuf-java`. To override it, set the `quarkus.generate-code.grpc.scan-for-imports` property in your `application.properties`. For example:
ja_jp: 指定されていない場合、プロパティーはデフォルトで `com.google.protobuf:protobuf-java` になります。 これをオーバーライドするには、 `application.properties` で `quarkus.generate-code.grpc.scan-for-imports` プロパティーを設定します。 以下に例を示します。

source: If not specified, the property is set to `com.google.protobuf:protobuf-java`. To override it, set the `quarkus.generate-code.grpc.scan-for-imports` property in your application.properties to the desired value, e.g.
ja_jp: 指定されていない場合、このプロパティは `com.google.protobuf:protobuf-java` に設定されます。これを上書きするには、application.propertiesに `quarkus.generate-code.grpc.scan-for-imports` を以下を例に必要な値を設定します。

source: If not, for Linux and macOS:
ja_jp: そうでない場合は、LinuxとmacOSの場合は次を実行下さい：

source: If not, we just delegate to the superclass method that will incorporate the method in the bytecode.
ja_jp: そうでない場合は、バイトコードにそのメソッドを組み込むスーパークラスのメソッドに委ねるだけです。

source: If nothing is configured for a particular cache, it will be created with the following basic configuration:
ja_jp: 特定のキャッシュについて何も設定されていない場合、以下の基本設定で作成されます。

source: If offset is -1, it seeks to the end of the topic-partition.
ja_jp: オフセットが -1 の場合、topic-partition の末尾をシークします。

source: If offset is 0, it seeks to the beginning of the topic-partition.
ja_jp: オフセットが 0 の場合、topic-partition の先頭をシークします。

source: If on the other hand, you wish to make every `update` operation explicit, then you need to use what Hibernate ORM calls a _stateless session_.
ja_jp: 一方で、すべての `update` 操作を明示的にしたい場合は、Hibernate ORM が _ステートレスセッション_ と呼ぶものを使用する必要があります。

source: If one extension requires a certain capability, there must be another one among the application dependencies that provides that capability, otherwise the build will fail with the corresponding error message.
ja_jp: 1つのエクステンションが特定のケイパビリティを必要とする場合、そのケイパビリティを提供するアプリケーションの依存関係の中に別のエクステンションが必要です。そうでない場合、ビルドは対応するエラーメッセージで失敗します。

source: If one of the watched keys is touched before or during the execution of the pre-transaction or transactional blocks, the transaction is aborted. The pre-transactional block produces a result that the transactional block can use. This construct is necessary because, within a transaction, the commands do not produce a result. Results can only be retrieved after the execution of the transaction.
ja_jp: プレトランザクションブロックまたはトランザクションブロックの実行前または実行中に監視されているキーの 1 つがタッチされた場合、トランザクションは中断されます。プレトランザクションブロックは、トランザクションブロックが使用できる結果を生成します。トランザクション内では、コマンドは結果を生成しないので、この構成は必要です。結果は、トランザクションの実行後にのみ取得することができます。

source: If one of those extensions is present, then creating a container image for the native executable is essentially a matter of executing a single command:
ja_jp: これらのエクステンションのいずれかが存在する場合、ネイティブ実行可能ファイル用のコンテナーイメージを作成することは、基本的には単一のコマンドを実行することになります:

source: If only `QUARKUS_DATASOURCE\__DATASOURCE_NAME__JDBC_URL` is present, the Config system needs to reconvert the configuration name to its most likely dotted format. This works fine for fixed configuration segments, but not for names that contain dynamic segments. In this case, Quarkus is unable to determine if `DATASOURCE_NAME` should be converted to `datasource.name` or `datasource-name` (or any other special character separator).
ja_jp: `QUARKUS_DATASOURCE__DATASOURCE_NAME__JDBC_URL` のみが存在する場合、Config システムは設定名を最も可能性の高いドット形式に再変換する必要があります。これは固定コンフィギュレーションセグメントに対しては問題なく機能しますが、ダイナミックセグメントを含む名前に対しては機能しません。この場合、Quarkusは `DATASOURCE_NAME` を `datasource.name` や `datasource-name` （またはその他の特殊文字区切り）に変換すべきかどうかを判断できません。

source: If only a subset of entities must be re-indexed or if there is a need to have a custom configuration of the underlying mass indexer then this information can be passed through the request body as shown below.
ja_jp: エンティティーのサブセットのみのインデックスを再作成する必要がある場合、または 基礎となる一括インデクサーのカスタム設定が必要な場合は、 以下に示すように、この情報をリクエスト本体を通じて渡すことができます。

source: If only certain services require `TLSv1.2`, it is recommended to configure a dedicated, named TLS configuration for those services and keep the default configuration for services that support `TLSv1.3`.
ja_jp: 特定のサービスのみが `TLSv1.2` を必要とする場合は、それらのサービス用に専用の名前付き TLS 設定を構成し、`TLSv1.3` をサポートするサービスにはデフォルト設定を維持することをお勧めします。

source: If only one of `username` or `password` is defined, the application fails at startup. The application also fails if the credentials cannot be retrieved from the provider. In both cases, a configuration error is reported.
ja_jp: `username` または `password` のいずれかのみが定義されている場合、アプリケーションは起動時に失敗します。クレデンシャルがプロバイダーから取得できない場合も、アプリケーションは失敗します。どちらの場合も、設定エラーが報告されます。

source: If only one viable extension is available, Quarkus assumes this is the correct one. When you add a driver to the test scope, Quarkus automatically includes it in testing.
ja_jp: 使用可能なエクステンションが 1 つしかない場合、Quarkus はそれが正しいものであると見なします。 テストスコープにドライバーを追加すると、Quarkus は自動的にそのドライバーをテストに含めます。

source: If only one viable extension is available, Quarkus assumes this is the correct one. When you add a driver to the test scope, Quarkus automatically includes the specified driver in testing.
ja_jp: 使用可能なエクステンションが1つしかない場合、Quarkusはこれを正しいエクステンションとみなします。テストスコープにドライバーを追加すると、Quarkusは自動的に指定したドライバーをテストに含めます。

source: If only the access token contains the roles and this access token is not meant to be propagated to the downstream endpoints then set `quarkus.oidc.roles.source=accesstoken`.
ja_jp: アクセストークンのみがロールを含み、このアクセストークンが下流のエンドポイントに伝播されることを意図していない場合は、 `quarkus.oidc.roles.source=accesstoken` をセットします。

source: If priority load shedding is disabled, all requests are rejected in an overload situation.
ja_jp: 優先負荷制限が無効になっている場合、過負荷状況ではすべてのリクエストが拒否されます。

source: If priority load shedding is disabled, there's nothing to do and all requests are rejected immediately. However, by default, priority load shedding is enabled, which means a request is only rejected if the current CPU load is high enough.
ja_jp: 優先負荷制限が無効になっている場合、何もせず、すべてのリクエストは直ちに拒否されます。しかし、デフォルトでは優先負荷制限が有効になっており、現在の CPU 負荷が十分に高い場合にのみリクエストが拒否されます。

source: If proactive authentication is not used, accessing `SecurityIdentity` is a blocking operation. This is because authentication might have yet to happen, and accessing `SecurityIdentity` might require calls to external systems, such as databases, that might block the operation. For blocking applications, this is not an issue. However, if you have disabled authentication in a reactive application, this fails because you cannot do blocking operations on the I/O thread. To work around this, you need to `@Inject` an instance of `io.quarkus.security.identity.CurrentIdentityAssociation` and call the `Uni<SecurityIdentity> getDeferredIdentity();` method. Then, you can subscribe to the resulting `Uni` to be notified when authentication is complete and the identity is available.
ja_jp: プロアクティブ認証が使用されている場合、 `SecurityIdentity` へのアクセスはブロッキング操作となります。 これは、認証がまだ行われていない可能性があり、 `SecurityIdentity` へのアクセスにはデータベースなどの外部システムへの呼び出しが必要になるため、操作がブロックされる可能性があるためです。 ブロッキング・アプリケーションの場合、これは問題ではありません。 しかし、リアクティブなアプリケーションで認証を無効にしている場合は、 I/O スレッドでブロッキング操作を行うことができないため、失敗します。 これを回避するには、 `io.quarkus.security.identity.CurrentIdentityAssociation` のインスタンスを `@Inject` し、 `Uni<SecurityIdentity> getDeferredIdentity();` メソッドを呼び出します。 そして、認証が完了して ID が利用可能になったときに通知されるように、生成された `Uni` をサブスクライブします。

source: If proactive authentication is used, accessing `SecurityIdentity` is a blocking operation. This is because authentication might have yet to happen, and accessing `SecurityIdentity` might require calls to external systems, such as databases, that might block the operation. For blocking applications, this is not an issue. However, if you have disabled authentication in a reactive application, this fails because you cannot do blocking operations on the I/O thread. To work around this, you need to `@Inject` an instance of `io.quarkus.security.identity.CurrentIdentityAssociation` and call the `Uni<SecurityIdentity> getDeferredIdentity();` method. Then, you can subscribe to the resulting `Uni` to be notified when authentication is complete and the identity is available.
ja_jp: プロアクティブ認証が使用されている場合、 `SecurityIdentity` へのアクセスはブロッキング操作となります。 これは、認証がまだ行われていない可能性があり、 `SecurityIdentity` へのアクセスにはデータベースなどの外部システムへの呼び出しが必要になるため、操作がブロックされる可能性があるためです。 ブロッキング・アプリケーションの場合、これは問題ではありません。 しかし、リアクティブなアプリケーションで認証を無効にしている場合は、 I/O スレッドでブロッキング操作を行うことができないため、失敗します。 これを回避するには、 `io.quarkus.security.identity.CurrentIdentityAssociation` のインスタンスを `@Inject` し、 `Uni<SecurityIdentity> getDeferredIdentity();` メソッドを呼び出します。 そして、認証が完了して ID が利用可能になったときに通知されるように、生成された `Uni` をサブスクライブします。

source: If provided, indicates that JWT is signed using a secret key.
ja_jp: 指定された場合、 JWT がシークレットキーを使用して署名されることを示します。

source: If questions post at https://github.com/quarkusio/quarkus/discussions[discussions] and mention `@maxandersen` .
ja_jp: 質問がある場合は、 https://github.com/quarkusio/quarkus/discussions[discussions] に投稿し、 `@maxandersen` にメンションしてください。

source: If reconnecting is necessary, for example, the `UserInfo` endpoint address may have changed for the tenant to rediscover it, then simply set a `RoutingContext` `replace-tenant-configuration-context` property to `true`:
ja_jp: 再接続が必要な場合、たとえば、テナントが `UserInfo` エンドポイントアドレスを再発見するために変更された可能性がある場合は、`RoutingContext` の `replace-tenant-configuration-context` プロパティーを `true` に設定するだけです。

source: If running `gdb` from a different directory than `target`, then the sources can be loaded by running:
ja_jp: `gdb` を `target` とは異なるディレクトリから実行している場合、ソースは以下を

source: If set to `false`, then a *new instance* of the resource class is created per each request.
ja_jp: `false` に設定すると、リクエストごとにリソースクラスの *新しいインスタンス* が作成されます。

source: If set to `true` (default), then a *single instance* of a resource class is created to service all requests (as defined by `@jakarta.inject.Singleton`).
ja_jp: `true` (デフォルト) に設定すると、すべてのリクエストを処理するためにリソースクラスの *単一のインスタンス* (`@jakarta.inject.Singleton` で定義) が作成されます 。

source: If set to a positive number, the connector will try to resend any record that was not delivered successfully (with a potentially transient error) until the number of retries is reached. If set to 0, retries are disabled. If not set, the connector tries to resend any record that failed to be delivered (because of a potentially transient error) during an amount of time configured by `delivery.timeout.ms`. Type: _long_
ja_jp: 正の数を設定すると、コネクターは、正常に配信されなかったレコード ( 一過性のエラーが発生する可能性があります ) を、再試行回数に達するまで再送しようとします。 0 に設定すると、再試行は無効になります。設定されていない場合、コネクターは、 `delivery.timeout.ms` で設定された時間の間、 ( 潜在的な一時的エラーのために ) 配信に失敗したすべてのレコードの再送を試みます。 Type: _long_

source: If set to true, access is denied for all Jakarta REST endpoints by default. If a Jakarta REST endpoint has no security annotations, it defaults to the `@DenyAll` behavior. This helps you to avoid accidentally exposing an endpoint that is supposed to be secured. Defaults to `false`.
ja_jp: true に設定すると、すべての Jakarta REST エンドポイントへのアクセスがデフォルトで拒否されます。 Jakarta REST エンドポイントにセキュリティーアノテーションがない場合、デフォルトで `@DenyAll` 動作になります。 これにより、保護されているはずのエンドポイントが誤って公開されることを回避できます。 デフォルトは `false` です。

source: If set to true, only one consumer can actively consume messages Type: _boolean_
ja_jp: trueに設定すると、1人のコンシューマのみがメッセージをアクティブに消費できるようになります。 Type: _boolean_

source: If set to true, the access is denied to all CDI methods and Jakarta REST endpoints that do not have security annotations but are defined in classes that contain methods with security annotations. Defaults to `false`.
ja_jp: true に設定すると、セキュリティーアノテーションを持たないが、セキュリティーアノテーションを持つメソッドを含むクラスで定義されているすべての CDI メソッドと Jakarta REST エンドポイントへのアクセスが拒否されます。 デフォルトは `false` です。

source: If set to true, the access will be denied for all JAX-RS endpoints by default, so if a JAX-RS endpoint does not have any security annotations then it will default to `@DenyAll` behaviour. This is useful to ensure you cannot accidentally expose an endpoint that is supposed to be secured. Defaults to `false`.
ja_jp: この値をtrue に設定すると、デフォルトですべての JAX-RS エンドポイントに対してアクセスが拒否されます。したがって、JAX-RS エンドポイントがセキュリティアノテーションを持っていない場合、デフォルトで `@DenyAll` の動作になります。これは、セキュリティで保護されているはずのエンドポイントを誤って公開してしまわないようにするために有用です。デフォルトは `false` です。

source: If set, configure the hostname value used for the connection AMQP Open frame and TLS SNI server name (if TLS is in use) Type: _string_
ja_jp: 設定されている場合は、接続に使用されるホスト名の値を設定します AMQP オープンフレームと TLS SNI サーバー名 (TLS が使用されている場合) タイプ: _string_

source: If set, explicitly override the hostname to use for the TLS SNI server name Type: _string_
ja_jp: 設定されている場合、TLS SNI サーバー名に使用するホスト名を明示的にオーバーライドします タイプ: _string_

source: If specified, the time (ms) for which a message can remain in the queue undelivered before it is dead Type: _long_
ja_jp: 指定されている場合、メッセージがデッドになる前に配信されないままキューに残る時間 (ms) Type: _long_

source: If specified, the time (ms) sent messages can remain in queues undelivered before they are dead Type: _long_
ja_jp: 指定されている場合、送信されたメッセージが未配信のままキューに残る時間 (ミリ秒) Type: _long_

source: If starting from an empty `application.properties` file, `Dev Services for Keycloak` automatically registers the following properties:
ja_jp: 空の `application.properties` ファイルから開始する場合、 `Dev Services for Keycloak` は次のプロパティーを自動的に登録します。

source: If that is not what you want, use `quarkus.hibernate-orm.mapping-files = no-file` or `<mapping-file>no-file</mapping-file>`.
ja_jp: それが望ましくない場合は、 `quarkus.hibernate-orm.mapping-files = no-file` または `<mapping-file>no-file</mapping-file>` を使用します。

source: If that node holds the data for key "1", you'll get a response like this:
ja_jp: そのノードがキー “1 “のデータを保持していれば、次のような応答が得られる:

source: If that's not what you want -- and if your tests write to the database, that's probably not what you want -- consider xref:hibernate-orm.adoc#dev-mode[configuring Hibernate ORM appropriately], or using xref:flyway.adoc[Flyway] or xref:liquibase.adoc[Liquibase].
ja_jp: テストがデータベースに書き込むのであれば、それはおそらく望んでいないことでしょう。 xref:hibernate-orm.adoc#dev-mode[Hibernate ORM を適切に設定] するか、 xref:flyway.adoc[Flyway] や xref:liquibase.adoc[Liquibase] を使うことを検討してください。

source: If that's not what you want -- and if your tests write to the indexes, that's probably not what you want -- consider reinitializing your schema and data on application startup. If you use Hibernate Search, xref:hibernate-search-orm-elasticsearch.adoc#quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-schema-management-strategy[Hibernate Search's schema management] may help with that.
ja_jp: それを回避する必要がある場合、およびテストがインデックスに書き込む場合、おそらく適切ではありません。 アプリケーションの起動時にスキーマとデータを再初期化することを検討してください。 Hibernate Search を使用する場合、 xref:hibernate-search-orm-elasticsearch.adoc#quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-schema-management-strategy[Hibernate Search のスキーマ管理] が 役に立つ可能性があります。

source: If the GET request requires path parameters you can leverage the `@PathParam("parameter-name")` annotation instead of (or in addition to) the `@QueryParam`. Path and query parameters can be combined, as required, as illustrated in the example below.
ja_jp: GET リクエストにパスパラメーターが必要な場合は、 `@QueryParam` の代わりに (あるいは加えて) `@PathParam ("parameter-name")` アノテーションを使用することができます。 パスパラメーターとクエリーパラメーターは、必要に応じて以下の例のように組み合わせることができます。

source: If the GET request requires path parameters you can leverage the `@PathParam("parameter-name")` annotation instead of (or in addition to) the `@QueryParam`. Path and query parameters can be combined, as required, as illustrated in a mock example below.
ja_jp: GETリクエストにパスパラメータが必要な場合は、 `@QueryParam` の代わりに（または追加で） `@PathParam("parameter-name")` を利用することができます。パスとクエリパラメータは、必要に応じて組み合わせることができます（以下のモックの例を参照してください）。

source: If the Hibernate `TenantResolver` also resolves tenants when there is no active HTTP request, for example when you query database from a scheduler, the `RoutingContext` CDI bean will not be available. Please inject the `io.quarkus.vertx.http.runtime.CurrentVertxRequest` CDI bean instead and get the `RoutingContext` from this bean.
ja_jp: Hibernate の `TenantResolver`がアクティブな HTTP リクエストがない場合でもテナントを解決する場合、 たとえば、スケジューラーからデータベースをクエリーする場合、 `RoutingContext` CDI Bean は使用できません。 代わりに `io.quarkus.vertx.http.runtime.CurrentVertxRequest` CDI Bean を注入し、この Bean から `RoutingContext` を取得してください。

source: If the ID token does not provide enough information about the currently authenticated user, you can get more information from the `UserInfo` endpoint.
ja_jp: ID トークンが現在認証されているユーザーに関する十分な情報を提供しない場合は、 `UserInfo` エンドポイントから詳細情報を取得できます。

source: If the ID token does not provide enough information about the currently authenticated user, you can get more information from the `UserInfo` endpoint. Set the `quarkus.oidc.authentication.user-info-required=true` property to request a link:https://openid.net/specs/openid-connect-core-1_0.html#UserInfo[UserInfo] JSON object from the OIDC `UserInfo` endpoint.
ja_jp: ID トークンが現在認証されているユーザーに関する十分な情報を提供しない場合は、 `UserInfo` エンドポイントから詳細情報を取得できます。 `quarkus.oidc.authentication.user-info-required=true` プロパティーを設定して、OIDC `UserInfo` エンドポイントから link:https://openid.net/specs/openid-connect-core-1_0.html#UserInfo[UserInfo] JSON オブジェクトをリクエストします。
